export default [
  // 常用字符
  {
    type: '常用字符',
    label: '匹配中文字符', 
    regular: /[\u4e00-\u9fa5]/gm
  },
  {
    type: '常用字符',
    label: '匹配双字节字符',
    regular: /[^\x00-\xff]/igm
  },
  {
    type: '常用字符',
    label: '匹配行尾和行首空白',
    regular: /(^\s*)|(\s*$)/
  },

  // 表单
  {
    type: '常用表单',
    label: '匹配Email地址', 
    regular: /\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*/
  },

  // path
  {
    type: '路径',
    label: 'linux"文件夹"路径',
    regular: /^(\/[^\/]+)+\/?$/
  },
  {
    type: '路径',
    label: 'linux"文件"路径',
    regular: /^(\/[^\/]+)+$/
  },
  {
    type: '路径',
    label: 'window下"文件夹"路径',
    regular: /^[a-zA-Z]:\\(?:\w+\\?)*$/
  },
  {
    type: '路径',
    label: 'window下"文件"路径',
    regular: /^[a-zA-Z]:\\(?:\w+\\)*\w+\.\w+$/
  },

  // 日期&时间
  {
    type: '时间格式',
    label: '24小时制时间（HH:mm:ss）',
    regular: /^(?:[01]\d|2[0-3]):[0-5]\d:[0-5]\d$/
  },
  {
    type: '时间格式',
    label: '12小时制时间（hh:mm:ss）',
    regular: /^(?:1[0-2]|0?[1-9]):[0-5]\d:[0-5]\d$/
  },

  // 数字
  {
    type: '数字',
    label: '数字/货币金额（支持负数、千分位分隔符）',
    regular: /^-?\d+(,\d{3})*(\.\d{1,2})?$/
  },
  {
    type: '数字',
    label: '数字/货币金额 (只支持正数、不支持校验千分位分隔符)',
    regular: /(?:^[1-9]([0-9]+)?(?:\.[0-9]{1,2})?$)|(?:^(?:0){1}$)|(?:^[0-9]\.[0-9](?:[0-9])?$)/
  },
  {
    type: '数字',
    label: '整数',
    regular: /^-?[1-9]\d*$/
  },
  {
    type: '数字',
    label: '正整数',
    regular: /^[1-9]\d*$/
  },
  {
    type: '数字',
    label: '负整数',
    regular: /^-[1-9]\d*$/
  },
  {
    type: '数字',
    label: '非负整数',
    regular: /^[1-9]\d*|0$/
  },
  {
    type: '数字',
    label: '非正整数',
    regular: /^-[1-9]\d*|0$/
  },
  {
    type: '数字',
    label: '浮点数',
    regular: /^-?([1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0)$/
  },
  {
    type: '数字',
    label: '正浮点数',
    regular: /^[1-9]\d*\.\d*|0\.\d*[1-9]\d*$/
  },
  {
    type: '数字',
    label: '负浮点数',
    regular: /^-([1-9]\d*\.\d*|0\.\d*[1-9]\d*)$/
  },
  {
    type: '数字',
    label: '非负浮点数',
    regular: /^[1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0$/
  },
  {
    type: '数字',
    label: '非正浮点数',
    regular: /^(-([1-9]\d*\.\d*|0\.\d*[1-9]\d*))|0?\.0+|0$/
  },

  // ip
  {
    type: 'ip',
    label: 'ip-v4',
    regular: /^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/
  },
  {
    type: 'ip',
    label: 'ip-v6',
    regular:/^((([0-9A-Fa-f]{1,4}:){7}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){6}:[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){5}:([0-9A-Fa-f]{1,4}:)?[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){4}:([0-9A-Fa-f]{1,4}:){0,2}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){3}:([0-9A-Fa-f]{1,4}:){0,3}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){2}:([0-9A-Fa-f]{1,4}:){0,4}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){6}((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|(([0-9A-Fa-f]{1,4}:){0,5}:((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|(::([0-9A-Fa-f]{1,4}:){0,5}((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|([0-9A-Fa-f]{1,4}::([0-9A-Fa-f]{1,4}:){0,5}[0-9A-Fa-f]{1,4})|(::([0-9A-Fa-f]{1,4}:){0,6}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){1,7}:))$/i
  },

  // 颜色
  {
    type: '颜色',
    label: '16进制颜色',
    regular: /^#?([a-fA-F0-9]{6}|[a-fA-F0-9]{3})$/
  }
]